app/Livewire/Payment/Dashboard.php

select * from `payment_types` order by `name` asc
---
    function summary()
    {

        $data[] = [
            "name" => "Bütün ödənişlər",
            "count" => Payment::query()->count() . " ədəd",
            "fund" => round(Payment::query()->sum("amount"), 2) . " AZN",
        ];

        $data[] = [
            "name" => "Ləğv edilən ödənişlər",
            "count" => Payment::query()->where("is_cancelled", true)->count() . " ədəd",
            "fund" => round(Payment::query()->where("is_cancelled", true)->sum("amount"), 2) . " AZN",
        ];

        foreach (PaymentType::query()->orderBy("name", "asc")->get() as $pt) {