app/Livewire/Payment/Dashboard.php

    function summary()
    {

        $data["all"] = [
            "name" => "Bütün ödənişlər",
            "count" => Payment::query()->count() . " ədəd",
            "fund" => round(Payment::query()->sum("amount"), 2) . " AZN",
        ];

        $data["cancelled"] = [
            "name" => "Ləğv edilən ödənişlər",
            "count" => Payment::query()->where("is_cancelled", true)->count() . " ədəd",
            "fund" => round(Payment::query()->where("is_cancelled", true)->sum("amount"), 2) . " AZN",
        ];

        $data["oldDebt"] = [
            "name" => "Öncədən olan borc",
            "count" => Payment::query()->where("type_id", 1)->count() . " ədəd",
            "fund" => round(Payment::query()->where("type_id", 1)->sum("amount"), 2) . " AZN",
        ];

        $data["balance"] = [
            "name" => "Müştərilərin balansı",
            "count" => Payment::query()->where("type_id", 2)->count() . " ədəd",
            "fund" => round(Payment::query()->where("type_id", 2)->sum("amount"), 2) . " AZN",
        ];

        $data["supplierDebt"] = [
            "name" => "Tədarüçklərin ödənişi",
            "count" => Payment::query()->where("type_id", 3)->count() . " ədəd",
            "fund" => round(Payment::query()->where("type_id", 3)->sum("amount"), 2) . " AZN",
        ];

        $data["salesDebt"] = [
            "name" => "Satışlardan yaranmış borc",
            "count" => Payment::query()->where("type_id", 4)->count() . " ədəd",
            "fund" => round(Payment::query()->where("type_id", 4)->sum("amount"), 2) . " AZN",
        ];
---
select sum(`amount`) as aggregate from `payments`
select count(*) as aggregate from `payments`
select sum(`amount`) as aggregate from `payments` where `is_cancelled` = 1
select count(*) as aggregate from `payments` where `is_cancelled` = 1
select sum(`amount`) as aggregate from `payments` where `type_id` = 2
select count(*) as aggregate from `payments` where `type_id` = 1
select sum(`amount`) as aggregate from `payments` where `type_id` = 1
select count(*) as aggregate from `payments` where `type_id` = 2
select sum(`amount`) as aggregate from `payments` where `type_id` = 3
select count(*) as aggregate from `payments` where `type_id` = 3
select sum(`amount`) as aggregate from `payments` where `type_id` = 4
select count(*) as aggregate from `payments` where `type_id` = 4

    function timeSummary()
    {

        $data[] = [
            "name" => "Cari gündə olan ödənişlər",
            "funds" => Payment::query()->where("is_cancelled", false)->whereDay("created_at", now()->day)->whereMonth("created_at", now()->month)->sum("amount")
        ];

        $data[] = [
            "name" => "Cari həftədə olan ödənişlər",
            "funds" => Payment::query()->where("is_cancelled", false)->whereBetween("created_at", [now()->startOfWeek(), now()])->sum("amount")
        ];

        $data[] = [
            "name" => "Cari ayda olan ödənişlər",
            "funds" => Payment::query()->where("is_cancelled", false)->whereBetween("created_at", [now()->startOfMonth(), now()])->sum("amount")
        ];

        $data[] = [
            "name" => "Cari ildə olan ödənişlər",
            "funds" => Payment::query()->where("is_cancelled", false)->whereBetween("created_at", [now()->startOfYear(), now()])->sum("amount")
---
select sum(`amount`) as aggregate from `payments` where `is_cancelled` = 0 and day(`created_at`) = '08' and month(`created_at`) = '11'
select sum(`amount`) as aggregate from `payments` where `is_cancelled` = 0 and `created_at` between '2024-11-04 00:00:00' and '2024-11-08 13:07:07'
select sum(`amount`) as aggregate from `payments` where `is_cancelled` = 0 and `created_at` between '2024-11-01 00:00:00' and '2024-11-08 13:07:07'
select sum(`amount`) as aggregate from `payments` where `is_cancelled` = 0 and `created_at` between '2024-01-01 00:00:00' and '2024-11-08 13:07:07'