app/Livewire/Payment/Details.php

select * from `payments` where `payments`.`id` = '42' limit 1
---
    function changeState($id = null)
    {
        $this->state = !$this->state;

        if (!is_null($id)) {
            $this->payment = Payment::find($id);