app/Livewire/User/Dashboard.php

    function summary()
    {
        $count = User::query()->count() . " ədəd";
---
select count(*) as aggregate from `users`