app/Livewire/User/Details.php

select * from `phones` where `phones`.`user_id` = 5 and `phones`.`user_id` is not null
---
    function updateUser()
    {

        $currentPhones = $this->user->phones->pluck("item");

        $personalData = collect($this->personalData)->filter();

        $phones = collect($personalData["phones"])->filter();

        if ($this->user->phones->isEmpty() && $phones->isEmpty()) {
            $this->dispatch("notify", state: "warning", msg: "Ən az bir ədəd əlaqə nömrəsi daxil edilməlidir");
            return;
        } elseif ($phones->isNotEmpty()) {

            if ($currentPhones->isNotEmpty()) {
                Phone::where("user_id", $this->user->id)->delete();