app/Livewire/User/Details.php

    function mount($id)
    {
        $this->user = User::findOrFail($id);
---
select * from `users` where `users`.`id` = '5' limit 1

    function payments()
    {
        $orderBy = Str::of($this->paymentSearch["orderBy"])->explode("|");
        $pid = $this->paymentSearch["pid"];
        $items = Payment::query();
        $items = $items->orderBy($orderBy->first(), $orderBy->last())->where("customer_id", $this->user->id);

        if (strlen($pid) > 2 && $pid != "") {
            $items = $items->where("pid", "like", "%$pid%");
        }

        return $items->paginate(pageName: 'payments', perPage: 10);
---
select * from `payments` where `customer_id` = 5 order by `id` desc limit 10 offset 0
select count(*) as aggregate from `payments` where `customer_id` = 5

    function orderSummary()
    {

        $data = [];
        $data[] = [
            "count" => Order::where("customer_id", $this->user->id)->count() . " ədəd",
            "amount" => round(Order::where("customer_id", $this->user->id)->sum("total"), 2) . " AZN",
            "name" => "Ümumi sifarişlər"
        ];

        foreach (OrderStatus::all() as $orderStatus) {
            $data[] = [
                "count" => Order::where([
                        "customer_id" => $this->user->id,
                        "status_id" => $orderStatus->id
                    ])->count() . " ədəd",
                "amount" => round(Order::where([
                        "customer_id" => $this->user->id,
                        "status_id" => $orderStatus->id
                    ])->sum("total"), 2) . " AZN",
                "name" => $orderStatus->name
            ];
---
select sum(`total`) as aggregate from `orders` where `customer_id` = 5
select * from `order_status`
select count(*) as aggregate from `orders` where (`customer_id` = 5 and `status_id` = 1)
select sum(`total`) as aggregate from `orders` where (`customer_id` = 5 and `status_id` = 1)