app/Exports/Orders.php

select * from `orders`
---
    public function view(): View
    {
//        $orders = Order::query()->orderBy("id", "desc")->get();

        return $this->view("exports.orders", [
            "orders" => Order::all()
        ]);