app/Events/AcceptPayment.php

insert into `payments` (`executor_id`, `order_id`, `customer_id`, `type_id`, `action_id`, `amount`, `note`, `updated_at`, `created_at`) values (5, 15, 3, 4, 1, 5, '', '2024-10-27 00:09:34', '2024-10-27 00:09:34')
---
    public function __construct($order = null, $customer = null, $type = null, $action = null, $amount = null, $note = "")
    {
        $payment = new Payment();
        $payment->executor_id = Auth::id();
        $payment->order_id = $order;
        $payment->customer_id = $customer;
        $payment->type_id = $type;
        $payment->action_id = $action;
        $payment->amount = $amount;
        $payment->note = $note;
        $payment->save();