app/Events/CreateOrderLog.php

insert into `order_logs` (`order_id`, `executor_id`, `info`, `note`, `created_at`) values (101, 1, '40 AZN məbləğində borc ödənişi daxil edildi.', null, '2024-10-28 16:29:40')
---
    public function __construct($orderId , $info , $note = null)
    {
        $orderLog = new OrderLog();
        $orderLog->order_id = $orderId;
        $orderLog->executor_id = Auth::id();
        $orderLog->info = $info;
        $orderLog->note = $note;
        $orderLog->save();