app/Livewire/Product/Dashboard.php

    function summary()
    {
        $data["all"] = [
            "name" => "Bütün məhsullar",
            "count" => Product::query()->count() . " ədəd",
        ];
        $data["active"] = [
            "name" => "Aktiv məhsullar",
            "count" => Product::query()->where("visible", true)->count() . " ədəd"
        ];
        $data["passive"] = [
            "name" => "Deaktiv məhsullar",
            "count" => Product::query()->where("visible", false)->count() . " ədəd"
---
select count(*) as aggregate from `products`
select count(*) as aggregate from `products` where `visible` = 1
select count(*) as aggregate from `products` where `visible` = 0

    function products()
    {
        $filters = collect($this->filters)->filter(function ($value) {
            return $value != '';
        });

        $orderBy = Str::of($this->orderBy)->explode("|");

        $items = Product::query();

        $items = $items->orderBy($orderBy->first(), $orderBy->last());

        if ($filters->has('name')) {
            $items = $items->where('name', 'like', "%" . $filters->get("name") . "%");
        }

        if ($filters->has('visible')) {
            $items = $items->where('visible', $filters->get("visible"));

        }

        $items = $items->paginate(10);
---
select * from `products` order by `name` asc limit 10 offset 0
select count(*) as aggregate from `products`