app/Livewire/Product/Edit.php

select * from `products` where `products`.`id` = 16 limit 1
---
    function changeState($id = null)
    {
        if (!is_null($id)) {
            $this->state = true;
            $this->id = $id;
            $product = Product::find($id);