app/Livewire/Login.php

select * from `users` where `role_id` = 1 order by `name` asc
---
    function executors()
    {
        return User::orderBy("name", "asc")->where("role_id", 1)->get();