app/Livewire/Raport.php

    function mount()
    {


        $this->years["min"] = Order::query()->first()->created_at->format("Y");
---
select * from `orders` limit 1

    function countByStatusWithInterval()
    {
        $data = [];

        $search = collect($this->countByStatusWithIntervalSearch)->filter();
        if ($search->count() == 1) {

            $funds = Order::query()
                ->whereDate("created_at", Carbon::make($search->first())->format("Y-m-d"))
                ->sum("total");
            $count = Order::query()
                ->whereDate("created_at", Carbon::make($search->first())->format("Y-m-d"))
                ->count();

        } elseif ($search->count() === 2) {

            $funds = Order::query()
                ->whereDate("created_at", "<=", Carbon::make($search->first())->format("Y/m/d"))
                ->whereDate("created_at", ">=", Carbon::make($search->first())->format("Y/m/d"))
                ->sum("total");

            $count = Order::query()
                ->whereDate("created_at", "<=", Carbon::make($search->first())->format("Y/m/d"))
                ->whereDate("created_at", ">=", Carbon::make($search->first())->format("Y/m/d"))
                ->count();

        } else {
            $funds = Order::query()
                ->sum("total");

            $count = Order::query()
                ->count();
---
select count(*) as aggregate from `orders`
select count(*) as aggregate from `orders` where month(`created_at`) = '01'

        foreach (OrderStatus::query()->orderBy("name", "asc")->get() as $os) {
            if ($search->count() == 1) {

                $funds = Order::query()
                    ->where("status_id", $os->id)
                    ->whereDate("created_at", Carbon::make($search->first())->format("Y/m/d"))
                    ->sum("total");
---
select count(*) as aggregate from `orders` where `status_id` = 4 and month(`created_at`) = '01'