app/Models/User.php

select * from `phones` where `user_id` = 3
---
    function phone()
    {
        $phones = Phone::where("user_id", $this->attributes["id"])->get();