app/Livewire/Order/Create.php

select distinct * from `order_items` where `receipt` like '%g%'
---
    function searchReceipts($term, $index)
    {
        if ($term != "") {
            $this->receipts[$index] = OrderItem::query()->where("receipt", "like", "%$term%")->distinct()->get()->pluck("receipt")->toArray();

select * from `users` where `users`.`id` = '5' limit 1
---
    function selectCustomer($id)
    {
        $user = User::find($id);

select * from `products` where `products`.`id` = '5' limit 1
---
    function selectedProduct($index)
    {
        $this->orderItems[$index]["note"] = Product::find($this->orderItems[$index]["productId"])->note;

select * from `users` limit 7 offset 0
select count(*) as aggregate from `users`
---
    function users()
    {
        $users = User::query();

        if ($this->searchUser != '') {
            $keyword = $this->searchUser;
            $users = $users->where("id", "like", "%$keyword%")
                ->orWhere("name", "like", "%$keyword%")
                ->orWhere("debt", "like", "%$keyword%")
                ->orWhere("balance", "like", "%$keyword%")
                ->orWhereHas("phones", function ($query) use ($keyword) {
                    $query->where("item", "like", "%$keyword%");
                })
                ->orWhereHas("role", function ($query) use ($keyword) {
                    $query->where("name", "like", "%$keyword%");
                });

        }

        $users = $users->paginate(7);

select * from `products` where `visible` = 1 order by `name` asc
---
    function products()
    {
        return Product::query()->where("visible",true)->orderBy("name", "asc")->get();

insert into `orders` (`customer_id`, `executor_id`, `status_id`, `amount`, `discount`, `total`, `debt`, `notes`, `updated_at`, `created_at`) values ('3', 5, 1, 10, 0, 10, 10, '', '2024-10-27 00:11:01', '2024-10-27 00:11:01')
update `orders` set `pid` = 'SFR27102024000016', `orders`.`updated_at` = '2024-10-27 00:11:01' where `id` = 16
select sum(`debt`) as aggregate from `orders` where `customer_id` = '3'
---
        $order->total = $this->summary["subTotal"];
        $order->debt = $order->total;
        $order->notes = $this->summary["note"];
        $order->save();

        $order->pid = "SFR" . $order->created_at->format("dmY") . Str::of($order->id)->padLeft(6, 0);
        $order->save();

        $order->customer->current_debt = Order::where("customer_id", $order->customer_id)->sum("debt");

insert into `order_items` (`order_id`, `receipt`, `product_id`, `amount`, `price`, `total`) values (16, 'Roberts - Luettgen', '26', '1', '10', 10)
---
            $orderItem->amount = $item["amount"];
            $orderItem->price = $item["price"];
            $orderItem->total = $item["total"];
            $orderItem->save();