app/Livewire/Order/Dashboard.php

            }
        }

        $items = $items->orderBy($orderBy->first(), $orderBy->last());
        $items = $items->paginate();
---
select * from `orders` order by `id` desc limit 15 offset 0
select count(*) as aggregate from `orders`

    function summary()
    {
        $count = Order::query()->count();
        $funds = Order::query()->sum("total");
        $funds = round($funds, 2);
        $data["all"] = [
            "name" => "Bütün sifarişlər",
            "count" => $count . " ədəd",
            "funds" => $funds . " AZN"
        ];

        $count = Order::query()->where("debt", ">", 0)->count();
        $funds = Order::query()->where("debt", ">", 0)->sum("total");
        $funds = round($funds, 2);
        $data["hasDebt"] = [
            "name" => "Borc olan sifarişlər",
            "count" => $count . " ədəd",
            "funds" => $funds . " AZN"
        ];

        $count = Order::query()->where("status_id", 4)->count();
        $funds = Order::query()->where("status_id", 4)->sum("total");
        $funds = round($funds, 2);
        $data["cancelled"] = [
            "name" => "Ləğv olunan sifarişlər",
            "count" => $count . " ədəd",
            "funds" => $funds . " AZN"
        ];

        $count = Order::query()->where("status_id", 1)->count();
        $funds = Order::query()->where("status_id", 1)->sum("total");
---
select count(*) as aggregate from `orders`
select sum(`total`) as aggregate from `orders`
select count(*) as aggregate from `orders` where `debt` > 0
select sum(`total`) as aggregate from `orders` where `debt` > 0
select count(*) as aggregate from `orders` where `status_id` = 4
select sum(`total`) as aggregate from `orders` where `status_id` = 4
select count(*) as aggregate from `orders` where `status_id` = 1
select sum(`total`) as aggregate from `orders` where `status_id` = 1

            "funds" => $funds . " AZN"
        ];

        $count = Order::query()->where("status_id", 2)->count();
        $funds = Order::query()->where("status_id", 2)->sum("total");
---
select count(*) as aggregate from `orders` where `status_id` = 2
select sum(`total`) as aggregate from `orders` where `status_id` = 2

            "funds" => $funds . " AZN"
        ];

        $count = Order::query()->where("status_id", 3)->count();
        $funds = Order::query()->where("status_id", 3)->sum("total");
---
select count(*) as aggregate from `orders` where `status_id` = 3
select sum(`total`) as aggregate from `orders` where `status_id` = 3

    function timeSummary()
    {
        $data[] = [
            "name" => "Cari günə olan sifarişlər",
            "count" => Order::query()->whereDay("created_at",now()->day)->whereMonth("created_at",now()->month())->count() . " ədəd"
        ];
        $data[] = [
            "name" => "Cari həftədə olan sifarişlər",
            "count" => Order::query()->whereBetween("created_at", [now()->startOfWeek(), now()])->count() . " ədəd"
        ];
        $data[] = [
            "name" => "Cari ayda olan sifarişlər",
            "count" => Order::query()->whereBetween("created_at", [now()->startOfMonth(), now()])->count() . " ədəd"
        ];
        $data[] = [
            "name" => "Cari ildə olan sifarişlər",
            "count" => Order::query()->whereBetween("created_at", [now()->startOfYear(), now()])->count() . " ədəd"
---
select count(*) as aggregate from `orders` where day(`created_at`) = '28' and month(`created_at`) = '12'
select count(*) as aggregate from `orders` where `created_at` between '2024-10-28 00:00:00' and '2024-10-28 13:59:36'
select count(*) as aggregate from `orders` where `created_at` between '2024-10-01 00:00:00' and '2024-10-28 13:59:36'
select count(*) as aggregate from `orders` where `created_at` between '2024-01-01 00:00:00' and '2024-10-28 13:59:36'