app/Livewire/Order/Details.php

select * from `order_items` where `order_id` = 101 limit 15 offset 0
select count(*) as aggregate from `order_items` where `order_id` = 101
---
    function orderItems()
    {
        return OrderItem::where("order_id", $this->order->id)->paginate();