app/Livewire/Order/Details.php

    function pay($method)
    {

        if ($method == "balance") {
            if ($this->order->customer->balance < $this->paymentData["amount"]) {
                $this->dispatch("notify", state: "warning", msg: "Balansda kifayət qədər vəsait yoxdur", autoHide: true);
                return;
            }
            $this->order->customer->decrement("balance", round($this->paymentData["amount"] - $this->paymentData["reminder"], 2));
        } else {
            if ($this->paymentData["addToBalance"]) {
                $this->order->customer->increment("balance", $this->paymentData["reminder"]);
                event(new AcceptPayment(order: null, amount: $this->paymentData["reminder"], customer: $this->order->customer_id, note: $this->order->pid . " kodlu sifarişin borc ödəniş qalığından yaranmış artım", action: 1, type: 2));
            }
        }

        $this->order->increment("paid", round($this->paymentData["amount"] - abs($this->paymentData["reminder"]), 2));
        $this->order->debt = $this->paymentData["debt"];
        $this->order->save();

        event(new AcceptPayment(order: $this->order->id, amount: round($this->paymentData["amount"] - $this->paymentData["reminder"], 2), customer: $this->order->customer_id, note: $this->paymentData["note"], action: 1, type: 4));

        event(new CreateOrderLog(orderId: $this->order->id, info: $this->paymentData["amount"] . " AZN məbləğində borc ödənişi daxil edildi."));
---
update `orders` set `paid` = `paid` + 30.88, `orders`.`updated_at` = '2024-10-28 16:31:45' where `id` = 100
select * from `orders` where `orders`.`id` = '101' limit 1

    function mount($id)
    {
        $this->order = Order::findOrFail($id);
---
select * from `orders` where `orders`.`id` = '92' limit 1

    function payments()
    {
        $items = Payment::where("order_id", $this->order->id)->where("type_id", 4)->where("is_cancelled", false)->orderBy("id", "desc");

        $items = $items->paginate(10);
---
select * from `payments` where `order_id` = 101 and `type_id` = 4 and `is_cancelled` = 0 order by `id` desc limit 10 offset 0
select count(*) as aggregate from `payments` where `order_id` = 101 and `type_id` = 4 and `is_cancelled` = 0

    function orderItems()
    {
        return OrderItem::where("order_id", $this->order->id)->paginate();
---
select * from `order_items` where `order_id` = 101 limit 15 offset 0
select count(*) as aggregate from `order_items` where `order_id` = 101

    function changeStatusToCancelled()
    {
        if ($this->cancelledData["note"] == "") {
            $this->dispatch("notify", state: "danger", msg: "Ləğv səbəbi daxil edilməlidir", autoHide: true);
            return;
        }

        $this->order->status_id = 4;
---
select * from `orders` where `orders`.`id` = '11' limit 1