app/Livewire/Order/Details.php

update `orders` set `paid` = `paid` + 5, `orders`.`updated_at` = '2024-10-27 00:09:34' where `id` = 15
---
    function acceptPayment()
    {
        $payFromBalance = $this->paymentInfo["fromBalance"];
        $amount = $this->paymentInfo["amount"];
        $debt = $this->paymentInfo["debt"];
        $reminder = $this->paymentInfo["reminder"];


        if ($amount == "" || $amount <= 0) {
            $this->dispatch("notify", state: "warning", msg: "Ödəniş miqdarı düzgün qeyd olunmamışdır.");
            return;
        }

        if ($payFromBalance) {
            if ($amount > $this->order->customer->balance) {
                $this->dispatch("notify", state: "warning", msg: "Balansda kifayət qədər vəsait yoxdur");
                return;
            } else {
                $this->order->customer->decrement("balance", $amount);
            }

        }

        if ($amount > $debt) {
            $amount = $amount - $reminder;
        }

        $this->order->increment("paid", $amount);

select sum(`debt`) as aggregate from `orders` where `customer_id` = 3
update `orders` set `debt` = 0, `orders`.`updated_at` = '2024-10-27 00:09:34' where `id` = 15
---
        $this->order->customer->current_debt = round(Order::where("customer_id", $this->order->customer_id)->sum("debt"), 2);
        $this->order->customer->debt = $this->order->customer->old_debt + $this->order->customer->current_debt;
        $this->order->customer->debt = round($this->order->customer->debt, 2);
        $this->order->customer->save();

select * from `orders` where `orders`.`id` = '13' limit 1
---
    function cancelOrder()
    {
        if ($this->cancelExplanation == "") {
            $this->dispatch("notify", state: "info", msg: "Sifariş ləğv edildi");
            return;
        }

        $this->order->status_id = 4;

select * from `payments` where `order_id` = 11 and `type_id` = 4 order by `id` desc limit 10 offset 0
select count(*) as aggregate from `payments` where `order_id` = 11 and `type_id` = 4
---
    function payments()
    {
        $items = Payment::where("order_id", $this->order->id)->where("type_id", 4)->orderBy("id", "desc");

        $items = $items->paginate(10);

select * from `order_items` where `order_id` = 11 limit 15 offset 0
select count(*) as aggregate from `order_items` where `order_id` = 11
---
    function orderItems()
    {
        return OrderItem::where("order_id", $this->order->id)->paginate();