app/Livewire/Order/Logs.php

select count(*) as aggregate from `order_logs` where date(`created_at`) = '2024-10-27' and `created_at` between '2024-10-21 00:00:00' and '2024-10-27 23:59:59'
select count(*) as aggregate from `order_logs` where date(`created_at`) = '2024-10-27' and `created_at` between '2024-10-21 00:00:00' and '2024-10-27 23:59:59' and month(`created_at`) = '12'
select count(*) as aggregate from `order_logs` where month(`created_at`) = '10' and year(`created_at`) = 2024
select count(*) as aggregate from `order_logs` where `created_at` between '2024-01-01 00:00:00' and '2024-10-27 22:59:49'
---
    function summary()
    {
        $count = OrderLog::query()->count();
        $data["all"] = [
            "name" => "Ümumi fəaliyyətlər",
            "count" => $count . " ədəd"
        ];

        $count = OrderLog::query()->whereDate("created_at",Carbon::today())->count();

        $data["daily"] = [
            "name" => "Bugünə olan fəaliyyətlər",
            "count" => $count . " ədəd"
        ];

        $count = OrderLog::query()->whereBetween("created_at",[Carbon::now()->startOfWeek(),Carbon::now()->endOfWeek()])->count();

        $data["weekly"] = [
            "name" => "Cari həftədə olan fəaliyyətlər",
            "count" => $count . " ədəd"
        ];

        $count = OrderLog::query()->whereMonth("created_at",Carbon::now()->month)->whereYear("created_at",now()->year)->count();

select * from `order_logs` order by `id` desc limit 15 offset 0
---
    function items()
    {
        $filters = collect($this->filters)->filter();
        $createdAt = collect($this->filters["createdAt"])->filter();

        $orderBy = Str::of($this->orderBy)->explode("|")->collect();
        $items = OrderLog::query();
        $items = $items->orderBy($orderBy->first(), $orderBy->last());